<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%--
      연산자 
      1. 산술연산자 ( + , - , * , / , % )
         + 는 순수하게 덧셈만 가능 (문자열 결합이 불가능) 
                              ----------
                                +=
         ${10+10} => 20
         ${10+"10"} => 20
              -----Integer.parseInt("10")
              ${10+="10"} => 1010
                  --
         ${null+10} => 10 
              null은 0으로 취급
         ${10+" 10"} => 오류 
         
       / : 나누기 
           ${5/2} => 2.5 (정수/정수=실수} 
           ${5 div 2}
           
       % : 결과는 왼쪽편 부호 
           ${10 % 3} = 1 
           ${10 % -3} = 1
           ${-10 % 3} = -1
           ${-10 % -3} = -1
           
           ${10 mod 3} = 1 
           ${10 mod -3} = 1
           ${-10 mod 3} = -1
           ${-10 mod -3} = -1 
           
      -----------------------------------------
       2. 비교연산자 : 숫자 , 문자 , 날짜 
          ==(eq) , != (ne) , < (lt) , > (gt), 
          <= (le), >= (ge)  true/false
          10==10      not equals
          10 eq 10
          
          
       3. 논리연산자 
          &&(and)
          ||(or)
       ---------------------------------------- 조건문에서 주로 사용
       4. empty => empty list
       5. 삼항연산자 => 조건?값:값
                     curpage>1?curpage-1:curpage
                     endPage<totalpage?endPage+1:endPage
       *********** 단항연산자 : 존재하지 않는다 (++,--)
 --%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
<%--
 &#36;{10+10}=${10+10 }<br>
 &#36;{10+"10"}=${10+"10" } : 공백이 포함되면 안된다<br> 
 &#36;{null+"10"}=${null+"10" } :null값은 자동으로 0으로 대체<br>
 &#36;{5/2}=${5/2 } : 정수/정수=실수 <br> 
 &#36;{5 div 2}=${5 div 2 } : 정수/정수=실수 <br> 
 &#36;{5%2}=${5%2 }  <br> 
 &#36;{5 mod 2}=${5 mod 2 } <br> 
 &#36;{5 += "2"}=${5 += "2" } : 문자열 결합 <br> 
--%>
 <%-- &#36;{10==10}=${10==10 }<br>
 &#36;{10 eq 10}=${10 eq 10 }<br>
 
 &#36;{10!=10}=${10!=10 }<br>
 &#36;{10 ne 10}=${10 ne 10 }<br>
 
 &#36;{10 < 10}=${10 < 10 }<br>
 &#36;{10 lt 10}=${10 lt 10 }<br>
 
 &#36;{10 > 10}=${10 > 10 }<br>
 &#36;{10 gt 10}=${10 gt 10 }<br>
 
 &#36;{10 <= 10}=${10 <= 10 }<br>
 &#36;{10 le 10}=${10 le 10 }<br>
 
 &#36;{10 >= 10}=${10 >= 10 }<br>
 &#36;{10 ge 10}=${10 ge 10 }<br> --%>
 
 <%-- &#36;{"홍길동" == "심청이"}=${"홍길동" ==  "심청이" }<br>
 &#36;{"홍길동" != "심청이"}=${"홍길동" !=  "심청이" }<br>
 &#36;{"홍길동" < "심청이"}=${"홍길동" <  "심청이" }<br>
 &#36;{"홍길동" > "심청이"}=${"홍길동" >  "심청이" }<br>
 &#36;{"홍길동" <= "심청이"}=${"홍길동" <=  "심청이" }<br>
 &#36;{"홍길동" >= "심청이"}=${"홍길동" >=  "심청이" }<br> --%>
 
 
</body>
</html>